tutorials/bladeMachines/extend-4.0/steadyCompressibleMRFFoam/simpleRotorStator/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{
    inlet
    {
        type            totalPressure;
        phi             phi;
        rho             none;
        psi             psi;
        U               U;
        gamma           1.4;
        p0              uniform 1.4e5;
        value           $internalField;
    }

    outlet
    {
        type            fixedValue;
        value           $internalField;
    }

    bladeRotor
    {
        type            zeroGradient;
    }

    shaftRotor
    {
        type            zeroGradient;
    }

    shroudRotor
    {
        type            zeroGradient;
    }

    bladeStator
    {
        type            zeroGradient;
    }

    shaftStator
    {
        type            zeroGradient;
    }

    shroudStator
    {
        type            zeroGradient;
    }

    frontAndBack
    {
        type            cyclic;
    }
}


// ************************************************************************* //
